In [ ]:
import pandas as pd

In [ ]:
d1 =pd.DataFrame({'RN':[1,2,3,4,5],'SName':['Soham','Suyash','sarvesh','Shubham','aditya']})
d2 =pd.DataFrame({'RN':[1,2,3,4,5],'Marks':['90','85','80','75','82']})
pd.merge(d1,d2,on='RN')

   RN    SName Marks
0   1    Soham    90
1   2   Suyash    85
2   3  sarvesh    80
3   4  Shubham    75
4   5   aditya    82

In [ ]:
df =pd.DataFrame({'RN':[1,2,3,4,5],'SName':['Soham','Suyash','sarvesh','Shubham','aditya'],'Marks':['90','85','80','75','82']})
df.pivot(index='RN',columns='SName',values='Marks')

SName Shubham Soham Suyash aditya sarvesh
RN
1         NaN    90    NaN    NaN     NaN
2         NaN   NaN     85    NaN     NaN
3         NaN   NaN    NaN    NaN      80
4          75   NaN    NaN    NaN     NaN
5         NaN   NaN    NaN     82     NaN

In [ ]:
df =pd.DataFrame({'RN':[1,2,None,4,None],'SName':['Soham','Suyash','sarvesh','Shubham','aditya'],'Marks':['90','85','80','75','82']})
k=df.pivot(index='RN',columns='SName',values='Marks')
print(k)

SName Shubham Soham Suyash aditya sarvesh
RN
NaN       NaN   NaN    NaN     82      80
1.0       NaN    90    NaN    NaN     NaN
2.0       NaN   NaN     85    NaN     NaN
4.0        75   NaN    NaN    NaN     NaN

In [ ]:
k.backfill(axis=0)

/tmp/ipykernel_17929/3297575113.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  k.backfill(axis=0)

SName Shubham Soham Suyash aditya sarvesh
RN
NaN        75    90     85     82      80
1.0        75    90     85    NaN     NaN
2.0        75   NaN     85    NaN     NaN
4.0        75   NaN    NaN    NaN     NaN

In [ ]:
k.backfill(axis=1)

/tmp/ipykernel_17929/3049719906.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  k.backfill(axis=1)

SName Shubham Soham Suyash aditya sarvesh
RN
NaN        82    82     82     82      80
1.0        90    90    NaN    NaN     NaN
2.0        85    85     85    NaN     NaN
4.0        75   NaN    NaN    NaN     NaN

In [ ]:
k.ffill(axis=0)

SName Shubham Soham Suyash aditya sarvesh
RN
NaN       NaN   NaN    NaN     82      80
1.0       NaN    90    NaN     82      80
2.0       NaN    90     85     82      80
4.0        75    90     85     82      80

In [ ]:
k.ffill(axis=1)

SName Shubham Soham Suyash aditya sarvesh
RN
NaN       NaN   NaN    NaN     82      80
1.0       NaN    90     90     90      90
2.0       NaN   NaN     85     85      85
4.0        75    75     75     75      75

In [ ]:
genders = ['Male','Female']
data['Gender']=np.random.choice(genders,size=len(data))